{"prev":{"slug":"introduction","title":"Introduction"},"next":{"slug":"chamber00-01","title":"Chamber 00/01"},"section":{"file":"main/01-movement-and-glitches.md","title":"Movement & Glitches","content":"<h2 id=\"basic-movement\">Basic Movement<a href=\"#basic-movement\" class=\"anchor\"><span class=\"visually-hidden\">permalink</span></a></h2><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/zMob4eflmpM\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n<h3 id=\"basic-movement-bunny-hopping\">Bunny Hopping<a href=\"#basic-movement-bunny-hopping\" class=\"anchor\"><span class=\"visually-hidden\">permalink</span></a></h3><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/YkayoUTJ0w0\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n<h3 id=\"basic-movement-abh\">ABH<a href=\"#basic-movement-abh\" class=\"anchor\"><span class=\"visually-hidden\">permalink</span></a></h3><p><strong>Accelerated Backwards Hopping</strong> or <strong>ABH</strong> is the main movement mechanic used in all Portal categories with the exception of Glitchless.<br>\nFor ABH, it is highly recommended to have <code>+jump</code> bound to your mouse wheel.<br>\nWhile it is possible to ABH <em>without</em> the mouse wheel, it is very precise and inconsistent to perform. The mouse wheel allows you to spam jump inputs much faster than pressing a key, this enables you to spend as little time on the floor as possible.</p>\n<p>To initiate an ABH, you need <strong>a certain starting velocity</strong>. You can achieve this by jumping forwards and turning 180 degrees mid-air. You may also start an ABH by <strong>jumping backwards and releasing S</strong> after you jump.<br>\nAt the same time you want to start holding your crouch key and let go of W. When you’re about to land, start scrolling your mouse wheel. You want to keep scrolling <strong>in small controlled bursts</strong> every time you get close to the ground.<br>\n<strong>Don’t scroll too fast</strong>, or the game will ignore your inputs. Do not hold S or the ABH will not work.</p>\n<p>If done correctly, this will build your speed up with every hop you perform.<br>\nThis is because of how Valve tried to patch out bunnyhopping from the engine. Whenever the game detects that you’re going above the speed limit (300 hu/s), it will push you in the <strong>opposite direction</strong> of where you’re facing.<br>\nThis is why you need to be facing backwards for an ABH to work. (There are workarounds for this, which are explained in the <a href=\"#basic-movement-afh\">AFH section</a>).</p>\n<p>Adding air strafes using the A and D key and moving your mouse in the opposite direction mid-air will increase your acceleration.</p>\n<h3 id=\"basic-movement-afh\">AFH<a href=\"#basic-movement-afh\" class=\"anchor\"><span class=\"visually-hidden\">permalink</span></a></h3><p><strong>Accelerated Forwards Hopping</strong> or <strong>AFH</strong> requires an even higher starting velocity to work.<br>\nTo AFH, you need to be facing the direction you want to go. Hold the S key in midair and start scrolling every time you are about to hit the ground.<br>\nThe game now thinks you are going backwards, and using the same logic as before, will try to slow you down by applying forwards velocity. This requires a higher initial velocity, since otherwise it will just slow you down like intended.<br>\nAFHing is used in Chamber 07 and Chamber 10, and also in some more advanced strats, like the starting AFH in Chamber 11.<br>\nWhile those chambers give you enough initial velocity to AFH right away, if you want to do it without the starting velocity, you need to either use an “S tap” (which is just pressing and holding S the moment you hit the ground) or <a href=\"https://www.youtube.com/watch?v=z2uA7j7EGlA\">use a <code>+strafe</code> key</a>.</p>\n<h3 id=\"basic-movement-ash\">ASH<a href=\"#basic-movement-ash\" class=\"anchor\"><span class=\"visually-hidden\">permalink</span></a></h3><p><strong>Accelerated Sideways Hopping</strong> or <strong>ASH</strong>, is not needed in Portal at all and is more commonly used in Half-Life 2.<br>\nYou can see where you’re going, with an ASH and you don’t need a high velocity to start one off, however it can be hard to control. You can use it in certain places to cover short walking distances quickly, and it can be used to pre-aim for the next portal shot by more advanced players.<br>\nThis is considered more of an optimisation than a required strat.</p>\n<p>To perform an ASH, start a forwards jump similar to the start to an <a href=\"#basic-movement-abh\">ABH</a>, but instead of turning 180 degrees, turn about 45 degrees to the left or right.<br>\nIf you turned 45 degrees left, you want to hold down both S and D, as you continue jumping whenever you hit the ground. Exchange D with A if you’re facing right.</p>\n<h3 id=\"basic-movement-other-movement-tech\">Other Movement Tech<a href=\"#basic-movement-other-movement-tech\" class=\"anchor\"><span class=\"visually-hidden\">permalink</span></a></h3><p><strong>Check out this video guide from Reassagressta on some other important movement tech:</strong></p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/jqExEAB68-o\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n<h2 id=\"glitches\">Glitches<a href=\"#glitches\" class=\"anchor\"><span class=\"visually-hidden\">permalink</span></a></h2><h3 id=\"glitches-super-throw\">Super Throw<a href=\"#glitches-super-throw\" class=\"anchor\"><span class=\"visually-hidden\">permalink</span></a></h3><ul>\n<li>You can interact with objects using <code>+use</code> (Default Bind: <code>E</code>)</li>\n<li>Throw them by using <code>+attack</code> (Default Bind: <code>Mouse1</code>)</li>\n<li>Super throw by holding down <code>mouse1</code> and then pressing <code>e</code>.</li>\n</ul>\n<p><strong>Here is a video by Inflame showing the differences in throw length between the three main throwing techniques:</strong></p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/RTZ_7FX-pGg\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n<h3 id=\"glitches-edge-glitch\">Edge Glitch<a href=\"#glitches-edge-glitch\" class=\"anchor\"><span class=\"visually-hidden\">permalink</span></a></h3><p><strong>Edge Glitch</strong> or <strong>EG</strong> is performed by standing on top or next to the edge of a portal, often it is required that you get stuck for it.\nThis will cause your camera to dislocate from your body, allowing you to shoot portals on the opposite portal from where you are.<br><br>\n<strong>Here is an example using the chamber 18 Edge Glitch route:</strong></p>\n<img src=\"/images/edge_glitch_explaination.png\" width=\"700\" height=\"400\">\n\n<p>On the lower left you see the player standing in Edge Glitch position above and very slightly away from the orange portal.\nOn the blue side the “True Position” is facing <strong>towards the floor</strong> because the blue portal is on the ceiling and facing a different way than the orange portal. Looking up would cause the “True Position” to actually face towards the wall on the right instead.<br>\nHowever since the blue portal and the target shot are separated by a wall, which adds a certain distance, you will have to move a tiny bit forwards away from the orange portal without exiting the “bubble” that counts as being Edge Glitched.\nThis now places the “True Position” directly above the door, allowing you to place a portal in front of it and continuing the route using the same system again.\nThe blue portal will now be on the floor, once again at a different angle than orange and the previous blue. This will change the way the “True Position” faces again.</p>\n<p><strong>To get the next shot you notice how the player has to look up onto the ceiling:</strong>\n<img src=\"/images/edge_glitch_explaination_2.png\" width=\"700\" height=\"400\"></p>\n<p><strong>Meanwhile the “True Position” looks similar to this:</strong>\n<img src=\"/images/edge_glitch_explaination_3.png\" width=\"700\" height=\"400\"></p>\n<p>Your “True Position” and the view you see will do the same movements according to how either sides portal is facing, everything is exactly mirrored.</p>\n<h3 id=\"glitches-save-glitch\">Save Glitch<a href=\"#glitches-save-glitch\" class=\"anchor\"><span class=\"visually-hidden\">permalink</span></a></h3><p><strong>Save Glitch</strong> or <strong>SG</strong> starts off the same as the <a href=\"#glitches-edge-glitch\">Edge Glitch</a>, while standing on top or next to the edge of a portal your camera gets dislocated from your body, the difference is that if you now save and then load that save you will be stuck in this state even if you move away from the portal.</p>\n<p>Collision while in the save glitch state is determined by what we call “Portal Physics Bubbles.” These bubbles exist to provide very basic physics calculations while a player is passing through a portal, before it is quickly updated to use the normal physics. The 2 key differences with these physics bubbles compared to normal physics are:</p>\n<ul>\n<li>Collision with the floor, walls and ceiling is only rendered in a small area around the portal you have save glitched on (hence the term “bubble”)<br><br></li>\n<li>Only Props positioned in FRONT of the save glitched portal have collision<br>\nThis means that props such as doors can be walked through like they don’t exist if positioned behind the save glitched portal</li>\n</ul>\n<p>Save Glitches get cancelled by passing through a portal or getting too close to one.\nOverall every action you perform is exactly mirrored for the “True Position” just like with a normal <a href=\"#glitches-edge-glitch\">Edge Glitch</a>.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/VSaYzZ7EQyA\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n<h3 id=\"glitches-lag-aag-vag\">LAG/AAG/VAG<a href=\"#glitches-lag-aag-vag\" class=\"anchor\"><span class=\"visually-hidden\">permalink</span></a></h3><p><strong>LAG</strong>, <strong>AAG</strong> and <strong>VAG</strong> (<strong>Large, Acute and Vertical angle glitches</strong>) are all variations of the same exploit, abusing a bug in the way teleports are executed. All of these give the same effect: the player is teleported 3 times in a single tick, once from the entry portal to the exit portal, and twice from the exit portal to the entry portal. The first two teleports cancel each other out, but the third places the player the same distance away from the entry portal as to the exit portal, but in a different direction.</p>\n<p>Now, despite all versions of this glitch having the same end result, each version has different activation methods and requirements.</p>\n<p><strong>LAG/AAG:</strong><br>\nTo trigger these angle glitches, you must enter a portal that is facing down and come out of a portal facing up. In addition, you must enter the portal standing and one of the two portals must not be facing exactly up or down. There are some more specific requirements on which angles of portals this trick will work for, but that&#39;s the general idea.</p>\n<p><strong>VAG:</strong><br>\nThe activation of this is different from LAG/AAG, it requires the player to stand exactly on a portal boundary (usually precise to 6-8 total decimal places). This trick should be possible on any orientations of portals, including wall, floor, and angled portals. However, this is not guaranteed to work for any particular pair of portals, in fact the majority of the time it will not. Due to the nature of the exploit, it is effectively impossible to predict when it will work on a specific portal pair, and it is extremely sensitive to many conditions including but not limited to: the orientation and locations of both portals, the portal placement order, and where the portals were shot from. Unlike LAG/AAG, VAG is also possible to perform on props.</p>\n<p><strong>Save Glitch from angle glitches</strong><br>\nAfter some angle glitches, the player will get a modified form of <a href=\"#glitches-save-glitch\">Save Glitch</a>. This modified <a href=\"#glitches-save-glitch\">Save Glitch</a> has different prop interactions than regular <a href=\"#glitches-save-glitch\">Save Glitch</a> and can be cancelled simply by shooting the <a href=\"#glitches-save-glitch\">Save Glitch</a> portal. <a href=\"./introduction#key-binds-save-load-bind\">Saveloading</a> while in this modified Save Glitch state will give the player regular <a href=\"#glitches-save-glitch\">Save Glitch</a>.</p>\n<h3 id=\"glitches-vertical-wall-warp\">Vertical Wall Warp<a href=\"#glitches-vertical-wall-warp\" class=\"anchor\"><span class=\"visually-hidden\">permalink</span></a></h3><p><strong>Vertical Wall Warp</strong> or <strong>VWW</strong> is an Out of Bounds exclusive glitch, allowing you to warp either to the top or the bottom of a wall located out of bounds space.<br>\nThe first step is to place a portal on the wall you want to warp up or down on. Next you position yourself in this portal. Make sure that you are actually peeking out of the portal on the target wall. Once you’ve done that crouch down, you will not get warped if you are standing up in the portal.\nNow, if you want to warp downwards, you simply save and load. Warping upwards requires an extra step. Jump and while you are still in your upwards motion save and load.<br>\nWarping upwards is used in OoB speedruns but warping downwards generally isn’t (currently).</p>\n"}}